In [11]:
import pandas as pd
from sqlalchemy import create_engine

# Consultas de Metadatos: PostgreSQL

In [39]:
usuario = "userPSQL"
contraseña = "passPSQL"
host = "localhost"  
puerto = "5432"
base_datos = "postgres"

engine = create_engine(f"postgresql+psycopg2://{usuario}:{contraseña}@{host}:{puerto}/{base_datos}")

Devolver toda la informmación de todas las asignaturas

In [40]:
query = """SELECT * FROM ASIGNATURAS"""
df = pd.read_sql(query, engine)
df.head()

,Unnamed: 0,id,nombre,numero_creditos,agno_academico,semestre,idioma
0,0,615000370,Gestion de Proyectos de Sistemas de Informacion,6,Cuarto curso,Séptimo semestre,Castellano
1,1,615000714,Bases de Datos,9,Segundo curso,Tercer semestre,Castellano
2,2,615000701,Analisis Matematico,6,Primer curso,Primer semestre,Castellano
3,3,615000721,Seguridad de la Informacion,3,Segundo curso,Cuarto semestre,Castellano
4,4,615000319,Programacion de Hw Reconfigurable,6,Tercero curso,Sexto semestre,Castellano

Devolver todos los profesores que imparten la asignatura Robótica

In [41]:
query = """
       SELECT P.* 
       FROM PROFESORES P 
       JOIN PROFESORESASIGNATURAS AP ON AP.PROFESOR_ID = P.id
       JOIN ASIGNATURAS A ON A.ID = AP.ASIGNATURA_ID
       WHERE A.NOMBRE = 'Robótica';
    """
df = pd.read_sql(query, engine)
df.head()

   Unnamed: 0  id                nombre            correo_electronico
0          57  57  Jose Eugenio Naranjo  joseeugenio.naranjo@upm.e\ns
1          58  58  Alfredo Valle Barrio          alfredo.valle@upm.es

Devolver los profesores que impartan más de 3 asignaturas

In [42]:
query = """
       SELECT P.NOMBRE, COUNT(A.ID) AS NUM_ASIGNATURAS
       FROM PROFESORES P 
       JOIN PROFESORESASIGNATURAS AP ON AP.PROFESOR_ID = P.ID
       JOIN ASIGNATURAS A ON A.ID = AP.ASIGNATURA_ID
       GROUP BY P.NOMBRE
       HAVING COUNT(A.ID) > 3;
    """
df = pd.read_sql(query, engine)
df.head()

                       nombre  num_asignaturas
0        Edgar Talavera Muñoz                5
1        Victor Jose Martinez                6
2  Sergio Alejandro D'antonio                4
3   Joaquin Entrialgo Castaño                5
4       Julio Cesar Hernandez                4

Devolver todas el profesor que imparte el mayor numero de asignaturas de la titulación Grado en Sistemas de Informacion

In [43]:
query = """
        SELECT P.NOMBRE,COUNT(DISTINCT A.ID) AS NUM_ASIGNATURAS
        FROM PROFESORES P
        JOIN PROFESORESASIGNATURAS AP ON AP.PROFESOR_ID = P.ID
        JOIN ASIGNATURAS A ON A.ID = AP.ASIGNATURA_ID
        JOIN TITULACIONESASIGNATURAS TA ON TA.ASIGNATURA_ID = A.ID
        JOIN TITULACIONES T ON T.ID = TA.TITULACION_ID
        WHERE T.NOMBRE = 'Grado en Sistemas de Informacion'
        GROUP BY  P.NOMBRE
        ORDER BY NUM_ASIGNATURAS DESC
        LIMIT 1;
    """
df = pd.read_sql(query, engine)
df.head()

                   nombre  num_asignaturas
0  Agustin Yague Panadero                4